---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
source: html/94d403d8-ea6a-6343-c1a3-8027e1de2178.htm
---
# AssetPropertyFloatArray Methods

Adds a new connected asset attached to this asset property, if it allows it.